Documents/СписаниеПросрочки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>СписаниеПросрочки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПросроченныеПартии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПартииЛекарств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лекарство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСкладе</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Лекарство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПартииЛекарств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/СписаниеПросрочки/Ext/ObjectModule.bsl
// Модуль объекта документа СписаниеПросрочки

Процедура ОбработкаПроведения(Отказ, Режим)
    НачатьТранзакцию();
    Попытка
        // Блокировка данных
        Блокировка = Новый БлокировкаДанных;
        Для Каждого СтрокаТЧ Из ПросроченныеПартии Цикл
            ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНаСкладе");
            ЭлементБлокировки.УстановитьЗначение("Партия", СтрокаТЧ.Партия);
            ЭлементБлокировки.УстановитьЗначение("Лекарство", СтрокаТЧ.Лекарство);
        КонецЦикла;
        Блокировка.Заблокировать();
        
        Движения.ОстаткиНаСкладе.Записывать = Истина;
        
        Для Каждого СтрокаТЧ Из ПросроченныеПартии Цикл
            Если Не ЗначениеЗаполнено(СтрокаТЧ.Партия) Или Не ЗначениеЗаполнено(СтрокаТЧ.Лекарство) Или СтрокаТЧ.Количество <= 0 Тогда
                Сообщить("Ошибка: Некорректные данные в строке табличной части для партии " + СтрокаТЧ.Партия + ". Строка пропущена.", СтатусСообщения.Важное);
                Продолжить;
            КонецЕсли;
            
            Движение = Движения.ОстаткиНаСкладе.Добавить();
            Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
            Движение.Период = Дата;
            Движение.Лекарство = СтрокаТЧ.Лекарство;
            Движение.Партия = СтрокаТЧ.Партия;
            Движение.Количество = СтрокаТЧ.Количество;
            Движение.ДатаПоступления = СтрокаТЧ.Партия.Дата; // Теперь это документ ПартииЛекарств
            Движение.СрокГодности = СтрокаТЧ.СрокГодности;
        КонецЦикла;
        
        Движения.ОстаткиНаСкладе.Записать();
        
        ЗафиксироватьТранзакцию();
    Исключение
        Если ТранзакцияАктивна() Тогда
            ОтменитьТранзакцию();
        КонецЕсли;
        Отказ = Истина;
        Сообщить("Ошибка при проведении: " + ОписаниеОшибки(), СтатусСообщения.Важное);
    КонецПопытки;
КонецПроцедуры
